linux/nix-cli-basics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nix CLI Basics</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' href='/css/default.css' />
<link rel='stylesheet' href='/css/source-code.css' />
</head>
<body>
<div id="preamble" class="status">

<h1 id='site-name'>
  <tt>
    <span class='org-br-prompt'>(</span><span class='org-keyword'>setq</span>
    <span class='org-variable-name'>plaintext</span>
    'everywhere<span class='org-br-prompt'>)</span>
  </tt>
</h1>
<div id='menu'>
  <a href='/'>Home</a>
  <a href='/ctf/index.html'>CTF WriteUps</a>
  <a href='/emacs/index.html'>Emacs</a>
  <a href='/linux/index.html'>Linux Tutorials</a>
  <a href='https://gitlab.com/bryos/dotfiles' target='_blank'>Dotfiles</a>
</div>
<br><hr>
</div>
<div id="content">
<h1 class="title">Nix CLI Basics</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#basic-nix-command-for-package-management">1. Basic Nix Command For Package Management</a></li>
<li><a href="#sources">2. Sources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org401a6a7" class="outline-2">
<h2 id="basic-nix-command-for-package-management"><span class="section-number-2">1</span> <a href="#basic-nix-command-for-package-management">Basic Nix Command For Package Management</a></h2>
<div class="outline-text-2" id="text-basic-nix-command-for-package-management">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2024-04-13 Sat]</span></span>
</p>

<p>
Just a list of basic commands with descriptions for the <code>nix</code> package
manager using imperative operations.
</p>
</div>

<div id="outline-container-org0240508" class="outline-3">
<h3 id="package-managment"><span class="section-number-3">1.1</span> <a href="#package-managment">Package Managment</a></h3>
<div class="outline-text-3" id="text-package-managment">
<p>
Search for packages is best done throught the web interface
<a href="https://search.nixos.org/packages">https://search.nixos.org/packages</a>. The cli for searching is very slow.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Searching for packages (slow)</td>
<td class="org-left">nix-env -qaP packagename</td>
</tr>

<tr>
<td class="org-left">Installing a package</td>
<td class="org-left">nix-env -iA packagename</td>
</tr>

<tr>
<td class="org-left">List installed packages</td>
<td class="org-left">nix-env -q</td>
</tr>

<tr>
<td class="org-left">Uninstall packages</td>
<td class="org-left">nix-env -e packagename</td>
</tr>

<tr>
<td class="org-left">Upgrade packages</td>
<td class="org-left">nix-env -u</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgab4aacd" class="outline-3">
<h3 id="channels"><span class="section-number-3">1.2</span> <a href="#channels">Channels</a></h3>
<div class="outline-text-3" id="text-channels">
<p>
Channels are where nix package definitions, etc are defined.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Listing current channels</td>
<td class="org-left">nix-channel &#x2013;list</td>
</tr>

<tr>
<td class="org-left">Adding a primary channel</td>
<td class="org-left">nix-channel &#x2013;add <a href="https://nixos.org/channels/channel-name">https://nixos.org/channels/channel-name</a> nixos</td>
</tr>

<tr>
<td class="org-left">Adding other channels</td>
<td class="org-left">nix-channel &#x2013;add <a href="https://some.channel/url">https://some.channel/url</a> my-alias</td>
</tr>

<tr>
<td class="org-left">Remove a channel</td>
<td class="org-left">nix-channel &#x2013;remove channel-alias</td>
</tr>

<tr>
<td class="org-left">Updating a channel</td>
<td class="org-left">nix-channel &#x2013;update channel-alias</td>
</tr>

<tr>
<td class="org-left">Updating all channels</td>
<td class="org-left">nix-channel &#x2013;update</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgab84159" class="outline-3">
<h3 id="garbage-collection"><span class="section-number-3">1.3</span> <a href="#garbage-collection">Garbage Collection</a></h3>
<div class="outline-text-3" id="text-garbage-collection">
<p>
Uninstalling nix packages does not remove them from your system, to do
that you need the nix garbage collector.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Delete everything not currently in use</td>
<td class="org-left">nix-collect-garbage -d</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgc0b06ea" class="outline-2">
<h2 id="sources"><span class="section-number-2">2</span> <a href="#sources">Sources</a></h2>
<div class="outline-text-2" id="text-sources">
<ul class="org-ul">
<li><a href="https://nixos.org/manual/nix/stable/command-ref/nix-env">https://nixos.org/manual/nix/stable/command-ref/nix-env</a></li>
<li><a href="https://nixos.org/manual/nix/stable/command-ref/nix-channel">https://nixos.org/manual/nix/stable/command-ref/nix-channel</a></li>
<li><a href="https://nixos.org/manual/nix/stable/command-ref/nix-collect-garbage">https://nixos.org/manual/nix/stable/command-ref/nix-collect-garbage</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<br><br>
<div style='text-align: center;'>
  If something is not working, please create an issue
  <a href='https://gitlab.com/bryanrinders/bryanrinders.xyz/-/issues'>here</a>.
</div>
<br><hr/>
<footer>
  <div class='copyright-container'>
    <div class='copyright'>
      Copyright &copy; 2022-2024 Bryan Rinders some rights reserved
      <br><br>
      This page is available under a
      <a rel='license' href='http://creativecommons.org/licenses/by/4.0/'>
        CC-BY 4.0
      </a> licence.
    </div>
  </div>
  <br>
  <div class='generated'>
    Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3) on <a href='https://www.gnu.org'>GNU</a>+<a href='https://www.kernel.org/'>Linux</a>
  </div>
</footer>
</div>
</body>
</html>
